NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_correction.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2018 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : r_correction.c
* Description  : This file contains functions necessary to "correct" silicon variations in current measurement.
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              :            0.82    Shinji Takeda: Line 667- Change 1000000 to 1024*1024.
*              : 04.10.2018 1.00    First Release
*              : 29.04.2019 1.10    Added error return codes to correction_CTSU_sensor_ico()
*                                     and correction_CTSU_measurement_start().
*                                   Added error checking in correction_CTSU_register_txd_set() switch default.
*                                   Added #pragma sections and ported to GCC/IAR.
*                                   Modified CTSUInterrupt() to
*                                     -load g_pvt_scan_info[] with status
*                                     -also not call callback when touch is performing offset tuning
*                                     -call custom callback if configured
*                                     -reset data_update flag on err in case using ext trig and Touch did not process
*                                       last scan yet
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "platform.h"
#include "r_ctsu_qe_if.h"
#include "r_ctsu_qe_private.h"
#include "qe_common.h"


/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define CTSU_PRV_0_NORMAL               (0)
#define CTSU_PRV_1_CORRECTION           (1)

#define CTSU_PRV_0_1ST                  (0)
#define CTSU_PRV_1_2ND                  (1)

#define CTSU_PRV_CORRECTION_AVERAGE     (32)        /* Correction measurement average times    */

#define CTSU_PRV_SENS_OK                (0x00)
#define CTSU_PRV_SENS_OVER              (0x01)
#define CTSU_PRV_REF_OVER               (0x02)
#define CTSU_PRV_SENS_REF_OVER          (0x03)

#define CTSU_PRV_WAFER_PARAMETER        (0.96523525)


/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/


/***********************************************************************************************************************
* Exported global variables
***********************************************************************************************************************/
/* for ctsu driver use */
uint16_t    g_correction_dtc_txd[3];           /* CTSU measurement parameter         */
uint8_t     g_correction_mode;                 /* Sensor correction mode flag        */

/* for Touch layer use */

#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_SAFETY_RAM
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(B, _QE_TOUCH_SAFETY_RAM, 2)
#endif
uint16_t    g_linear_interpolation_table[61];
uint16_t    g_linear_interpolation_coefficient[61];
#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE_END
#endif


/***********************************************************************************************************************
External global variables and functions
***********************************************************************************************************************/


/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
static uint16_t                g_correction_1st_coefficient;      /* 1st correction coefficient         */
static volatile ctsu_status_t  g_correction_status;               /* CTSU correction status flag        */
static uint32_t                g_correction_2nd_val;              /* 2nd standard correction value      */
static uint8_t                 g_correction_time;                 /* CTSU correction measurement flag   */
static uint16_t                g_correction_16point[16];          /* 16 point correction sensor data    */
static uint16_t                g_correction_16table[16];          /* 16 point correction table          */
static uint16_t                g_correction_16coefficient[16];    /* 16 point correction coefficient    */
static uint32_t                g_correction_1st_val;              /* 1st standard correction value      */
static uint16_t                g_correction_2nd_std_val;
static uint8_t                 g_correct_value_measure;
static uint16_t                g_correction_2nd_coefficient;      /* 2nd correction coefficient         */
static volatile ctsu_status_t  g_correction_status;               /* CTSU correction status flag        */



#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_SAFETY_CONSTANT
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(C, _QE_TOUCH_SAFETY_CONSTANT, 2)
#endif
static const uint16_t g_ctsu_correction_std[] =
{
    QE_19_2UA, QE_18_0UA, QE_16_8UA, QE_15_6UA, QE_14_4UA, QE_13_2UA, QE_12_0UA, QE_10_8UA,
    QE_09_6UA, QE_08_4UA, QE_07_2UA, QE_06_0UA, QE_04_8UA, QE_03_6UA, QE_02_4UA, QE_01_2UA
};
#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE_END
#endif


#if (CTSU_HAS_TRIMMER_REG)
static uint8_t g_ctsutrimr_def;
#endif

static void    configure_correction_method(void);
static void    correction_CTSU_register_txd_set(void);
static void    R_Set_CTSU_Correction_Mode(uint8_t mode);
static qe_err_t correction_CTSU_measurement_start(void);
static void    correction_CTSU_1st_coefficient_create(void);
static void    correction_CTSU_2nd_standard_val_create(void);
static void    correction_CTSU_2nd_coefficient_create(void);
static void    correction_CTSU_16point_coefficient_create(void);
static void    sensor_linear_interpolation(void);
static uint8_t CTSUGetTscapVoltageError(void);
static void    R_Set_CTSU_Power_Supply_Only(uint8_t mode);
static uint8_t R_Get_CTSU_Counter_Overflow_flag(void);


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_sensor_ico
* Description  : Sensor ICO gain correction initial setting.
* Arguments    : None
* Return Value : QE_SUCCESS -
*                   Correction completed successfully
*                QE_ERR_ABNORMAL_TSCAP -
*                   TSCAP error detected during correction
*                QE_ERR_SENSOR_OVERFLOW -
*                   Sensor overflow error detected during correction
*                QE_ERR_SENSOR_SATURATION -
*                   Initial sensor value beyond linear portion of correction curve
***********************************************************************************************************************/
qe_err_t correction_CTSU_sensor_ico( void )
{
    qe_err_t    err=QE_SUCCESS;

    g_correction_mode  = CTSU_PRV_1_CORRECTION;                            /* Sensor ICO correction measurement mode setting  */
    g_correction_time  = CTSU_PRV_0_1ST;                                   /* 1st measurement flag setting                    */

#if (CTSU_HAS_TRIMMER_REG)
    g_ctsutrimr_def    = CTSU.CTSUTRMR;                            /* Current trimming value storage                  */
#endif


