NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_correction.c
    while (0 != CTSU.CTSUCR0.BIT.CTSUSTRT)
    {
        ;  /* Measurement finish wait */
    }

    configure_correction_method();

    while (CTSU_PRV_1_CORRECTION == g_correction_mode)
    {
        correction_CTSU_register_txd_set();                    /* CTSU correction parameter setting by DTC.       */
        R_Set_CTSU_Correction_Mode(CTSU_PRV_1_CORRECTION);             /* Sensor ICO correction measurement setting       */
        g_ctsu_ctrl.state = CTSU_STATE_READY;                  /* CTSU measurement ready mode setting             */
        err = correction_CTSU_measurement_start();             /* Sensor ICO gain correction measurement start    */
        if (QE_SUCCESS != err)
        {
            break;
        }

        if (CTSU_PRV_0_1ST == g_correction_time)
        {
            correction_CTSU_1st_coefficient_create();          /* 1st coefficient create                          */
            correction_CTSU_2nd_standard_val_create();         /* 2nd standard value create                       */
            g_correction_time = CTSU_PRV_1_2ND;                /* 2nd measurement flag setting                    */
#if (CTSU_HAS_TRIMMER_REG)
            CTSU.CTSUTRMR = 0xFF;                              /* 0xFF set in the current trimming register       */
#endif
        }
        else
        {
            correction_CTSU_2nd_coefficient_create();          /* 2nd coefficient create                          */
            correction_CTSU_16point_coefficient_create();      /* 16point coefficient create                      */
#if (CTSU_HAS_TRIMMER_REG)
            CTSU.CTSUTRMR = g_ctsutrimr_def;                   /* Return the current trimming register to the initial value */
#endif
            R_Set_CTSU_Correction_Mode(CTSU_PRV_0_NORMAL);     /* Sensor ICO normal measurement setting            */
            g_correction_mode = CTSU_PRV_0_NORMAL;             /* Sensor ICO normal measurement mode setting      */
        }
    }

    return err;
}    /* End of function correction_CTSU_sensor_ico() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: configure_correction_method
* Description  :
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
static void configure_correction_method(void)
{

    g_ctsu_ctrl.mode = CTSU_MODE_SELF_MULTI_SCAN;

    CTSU.CTSUCR1.BYTE = 0x43;
    while (1 != CTSU.CTSUCR1.BIT.CTSUPON)                       /* Wait for charging to stabilize */
    {
        ;
    }

    CTSU.CTSUSDPRS.BYTE = 0x23;
    CTSU.CTSUSST.BYTE = 0x10;   // always
    CTSU.CTSUDCLKC.BYTE = 0x30; // always

    /* Enable lowest configured channel */
    if (0 != gp_cur_cfg->ctsuchac0)
    {
        CTSU.CTSUCHAC0.BYTE = gp_cur_cfg->ctsuchac0 & (-gp_cur_cfg->ctsuchac0);
    }
    else if (0 != gp_cur_cfg->ctsuchac1)
    {
        CTSU.CTSUCHAC1.BYTE = gp_cur_cfg->ctsuchac1 & (-gp_cur_cfg->ctsuchac1);
    }
#if (CTSU_HAS_LARGE_REG_SET)
    else if (0 != gp_cur_cfg->ctsuchac2)
    {
        CTSU.CTSUCHAC2.BYTE = gp_cur_cfg->ctsuchac2 & (-gp_cur_cfg->ctsuchac2);
    }
    else if (0 != gp_cur_cfg->ctsuchac3)
    {
        CTSU.CTSUCHAC3.BYTE = gp_cur_cfg->ctsuchac3 & (-gp_cur_cfg->ctsuchac3);
    }
    else
    {
        CTSU.CTSUCHAC4.BYTE = gp_cur_cfg->ctsuchac4 & (-gp_cur_cfg->ctsuchac4);
    }
#endif

#if (CTSU_HAS_TXVSEL)
    CTSU.CTSUCR0.BIT.CTSUTXVSEL = 0;    // in SELF mode; cannot equal 1
#endif

    /* Initialize CTSU hardware control block */
    CTSU.CTSUCR0.BIT.CTSUINIT = 1;

    return;
} /* End of function configure_correction_method() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_Set_CTSU_Correction_Mode
* Description  :
* Arguments    : uint8_t mode    : 0 Normal mode    1 Test mode
* Return Value : none
***********************************************************************************************************************/
static void R_Set_CTSU_Correction_Mode( uint8_t mode )
{
    if (0 == SYSTEM.MSTPCRD.BIT.MSTPD10)
    {
        if (0 == CTSU.CTSUCR0.BIT.CTSUSTRT)
        {
            /***** CTSU Channel Transmit/Receive Control Register 0 (CTSUCHTRC0) **************************************/
            /* bit15   TSCAP Voltage Error Flag                                                                       */
            /* bit14-8 Reserved                                                                                       */
            /* bit7    CTSU Test Mode Select                                                                          */
            /* bit6-2  Reserved                                                                                       */
            /* bit1-0  CTSU Reference Current Test Mode (VDC Stop)                                                    */
            /**********************************************************************************************************/
            if (0 == mode)
            {
                CTSU.CTSUERRS.BIT.CTSUTSOC = 0;                       /* Bit7(CTSUTSOC)   setting                     */
                CTSU.CTSUERRS.BIT.CTSUSPMD = 0;                       /* Bit1,0(CTSUSPMD) setting                     */
            }
            else
            {
                CTSU.CTSUERRS.BIT.CTSUTSOC = 1;                       /* Bit7(CTSUTSOC)   setting                     */
                CTSU.CTSUERRS.BIT.CTSUSPMD = 2;                       /* Bit1,0(CTSUSPMD) setting                     */
            }
        }
    }
}    /* End of function R_Set_CTSU_Correction_Mode() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_register_txd_set
* Description  : CTSU correction parameters transmit setting by DTC.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static void correction_CTSU_register_txd_set( void )
{
    if (0 == g_correct_value_measure)
    {
        g_correction_dtc_txd[0] = 0x0700;
        g_correction_dtc_txd[1] = 0x0000;

        switch (CTSU_INPUT_FREQUENCY_DIV)
        {
            case 32:
            {
                g_correction_dtc_txd[2] = 0x3F0F;       /* 32 / 64 = 0.5MHz              */
                break;
            }
            case 27:
            {
                g_correction_dtc_txd[2] = 0x3A0F;       /* 27 / 54 = 0.5MHz              */
                break;
            }
            case 24:
            {
                g_correction_dtc_txd[2] = 0x370F;       /* 24 / 48 = 0.5MHz              */
                break;
            }
            case 16:
            {
                g_correction_dtc_txd[2] = 0x2F0F;       /* 16 / 32 = 0.5MHz              */
                break;
            }
            case 8:
            {
                g_correction_dtc_txd[2] = 0x270F;       /*  8 / 16 = 0.5MHz              */
                break;
            }
            default:
#if ((CTSU_INPUT_FREQUENCY_DIV != 32) \
  && (CTSU_INPUT_FREQUENCY_DIV != 27) \
  && (CTSU_INPUT_FREQUENCY_DIV != 24) \
  && (CTSU_INPUT_FREQUENCY_DIV != 16) \
  && (CTSU_INPUT_FREQUENCY_DIV != 8))
#error "Unsupported clock frequency detected."
#endif
            {
                break;
            }
        }

#ifdef BSP_MCU_RX23_ALL
        if(CTSU_PRV_1_2ND == g_correction_time)
        {
            g_correction_dtc_txd[2] = g_correction_dtc_txd[2] | 0x6000;              /* ICO gain  66% -> 40%          */
        }
#endif
    }
}    /* End of function correction_CTSU_register_txd_set() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_measurement_start
* Description  : Sensor ICO gain correction measurement start.
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static qe_err_t correction_CTSU_measurement_start( void )
{
    uint8_t     measure_count;
    uint32_t    sensor_ico_add;
    qe_err_t    err = QE_SUCCESS;

