NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_correction.c
    measure_count  = 0;
    sensor_ico_add = 0;

    while (CTSU_PRV_CORRECTION_AVERAGE != measure_count)                /* Average number of times loop */
    {
        while (CTSU_STATE_READY == g_ctsu_ctrl.state)
        {
            g_ctsu_ctrl.state = CTSU_STATE_RUN;                         /* CTSU measurement run mode setting */

            /* WARNING! Do NOT call R_CTSU_StartScan(). That is for application layer.
             * It may be using external triggers or the DTC for non-correction registers values.
             */
            CTSU.CTSUCR0.BIT.CTSUSTRT = 1;      // Start scan
        }

        if (CTSU_STATE_FINISH == g_ctsu_ctrl.state)
        {
            if (1 == g_correction_status.flag.data_update)
            {
                sensor_ico_add = sensor_ico_add + gp_cur_cfg->p_scan_buf[0];
                measure_count  = measure_count + 1;                     /* Measurement count up */

                g_correction_status.flag.data_update = 0;               /* Update flag clear */
                g_ctsu_ctrl.state = CTSU_STATE_READY;                   /* CTSU measurement run mode setting */
            }
            else if (1 == g_correction_status.flag.icomp_error)
            {
                return QE_ERR_ABNORMAL_TSCAP;
            }
            else if (1 == g_correction_status.flag.sens_over)
            {
                return QE_ERR_SENSOR_OVERFLOW;
            }
        }
    }

    if (CTSU_PRV_0_1ST == g_correction_time)                            /* 1st measurement judgment */
    {
        g_correction_1st_val = sensor_ico_add / CTSU_PRV_CORRECTION_AVERAGE;   /* get average */
        sensor_ico_add       = 0;                                       /* Sensor ico addition data clear */
        if (g_correction_1st_val >= CTSU_SENSOR_SATURATION)
        {
            err = QE_ERR_SENSOR_SATURATION;
        }
    }
    else
    {
        g_correction_2nd_val = sensor_ico_add / CTSU_PRV_CORRECTION_AVERAGE;   /* get average */
    }

    return err;
}    /* End of function correction_CTSU_measurement_start() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: CTSUInterrupt
* Description  : CTSU measurement end interrupt function
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
void CTSUInterrupt( void )
{
    uint8_t         err_status;
    ctsu_status_t   status;
    ctsu_isr_evt_t  event;


    status = gp_cur_cfg->ctsu_status;
    g_pvt_scan_info[g_ctsu_ctrl.cur_method].ctsuerrs = CTSU.CTSUERRS.WORD;
    g_pvt_scan_info[g_ctsu_ctrl.cur_method].ctsust = CTSU.CTSUST.BYTE;

    if (0 != CTSUGetTscapVoltageError())
    {
        if (CTSU_PRV_1_CORRECTION == g_correction_mode)
        {
            g_correction_status.flag.icomp_error = 1;   /* TSCAP voltage error */
        }
        else
        {
            status.flag.icomp_error = 1;                /* TSCAP voltage error */
        }
        R_Set_CTSU_Power_Supply_Only(0x00);             /* TSCUPON off -> TSCUICOMP clear */
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
        nop();
        nop();
#else
        R_BSP_NOP();
        R_BSP_NOP();
#endif
        R_Set_CTSU_Power_Supply_Only(0x01);             /* TSCUPON on */
    }
    else
    {
        if (CTSU_PRV_1_CORRECTION == g_correction_mode)
        {
            g_correction_status.flag.icomp_error = 0;   /* TSCAP voltage error clear */
        }
        else
        {
            status.flag.icomp_error = 0;                /* TSCAP voltage error clear */
        }
    }

    err_status = R_Get_CTSU_Counter_Overflow_flag();
    CTSU.CTSUST.BYTE &= 0x9F;                           /* clear possible overflow flags */

    if (CTSU_PRV_1_CORRECTION == g_correction_mode)
    {
        switch (err_status)
        {
            case CTSU_PRV_SENS_OK:
                g_correction_status.flag.sens_over = 0;
                g_correction_status.flag.ref_over = 0;
                if (1 != g_correction_status.flag.icomp_error)  /* TSCAP voltage error */
                {
                    g_correction_status.flag.data_update = 1;   /* Measurement data update status set */
                }
                g_ctsu_ctrl.state = CTSU_STATE_FINISH;
                g_correction_status.flag.ctsu_measure = 1;
                break;

            case CTSU_PRV_SENS_OVER:
                g_correction_status.flag.ref_over = 0;
                g_correction_status.flag.sens_over = 1;         /* Sensor Counter overflow status set */
                g_ctsu_ctrl.state = CTSU_STATE_FINISH;
                break;

            default:
                g_ctsu_ctrl.state = CTSU_STATE_STOP;
                break;
        }
    }
    else
    {
        switch (err_status)
        {
            case CTSU_PRV_SENS_OK:
                status.flag.sens_over = 0;
                status.flag.ref_over = 0;
                if (1 != status.flag.icomp_error)         /* TSCAP voltage error */
                {
                    status.flag.data_update = 1;          /* Measurement data update status set */
                    event = CTSU_EVT_SCAN_COMPLETE;
                }
                else
                {
                    event = CTSU_EVT_VOLT_ERR;
                }
                g_ctsu_ctrl.state = CTSU_STATE_READY;
                status.flag.ctsu_measure = 1;
                break;

            case CTSU_PRV_SENS_OVER:
                status.flag.ref_over = 0;
                status.flag.sens_over = 1;                /* Sensor Counter overflow status set     */
                status.flag.data_update = 0;    // clear in case using ext trig and Touch did not process last scan
                event = CTSU_EVT_SENSOR_OVERFLOW;
                g_ctsu_ctrl.state = CTSU_STATE_READY;
                break;

