NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_correction.c
            case CTSU_PRV_REF_OVER:
                status.flag.sens_over = 0;
                status.flag.ref_over = 1;                 /* Reference Counter overflow status set  */
                status.flag.data_update = 0;    // clear in case using ext trig and Touch did not process last scan
                event = CTSU_EVT_SENSOR_OVERFLOW;
                g_ctsu_ctrl.state = CTSU_STATE_READY;
                break;

            case CTSU_PRV_SENS_REF_OVER:
                status.flag.sens_over = 1;                /* Sensor Counter overflow status set     */
                status.flag.ref_over = 1;                 /* Reference Counter overflow status set  */
                status.flag.data_update = 0;    // clear in case using ext trig and Touch did not process last scan
                event = CTSU_EVT_OVERFLOW;
                g_ctsu_ctrl.state = CTSU_STATE_READY;
                break;

            default:
                g_ctsu_ctrl.state = CTSU_STATE_STOP;
                break;
        }
    }

    gp_cur_cfg->ctsu_status = status;

    /* if not doing correction or offset tuning, do callback as appropriate */
    if ((CTSU_PRV_1_CORRECTION != g_correction_mode) && (1 != gp_cur_cfg->ctsu_status.flag.offset_tuning))
    {
        /* if power user created special callback, call that
         * if using external triggers, call default callback to notify user that scan is done
         * no callback is made by default for sw triggers because that is done by the timer interrupt
         */
        if (NULL != g_ctsu_ctrl.p_callback)
        {
            g_ctsu_ctrl.p_callback(event, &g_ctsu_ctrl.cur_method);
        }
        else if (QE_TRIG_EXTERNAL == g_ctsu_ctrl.trigger)
        {
            qetouch_timer_callback(NULL);
        }
    }


}    /* End of function CTSUInterrupt() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: CTSUGetTscapVoltageError
* Description  : This API reads the value in [CTSU Error Status Register (CTSUERRS)].
* Arguments    : None
* Return Value : data
***********************************************************************************************************************/
static uint8_t CTSUGetTscapVoltageError( void )
{
    /* CTSU Error Status Register (CTSUERRS)
    b15        CTSU TSCAP voltage error
    b14-0    Reserved    */
    return(CTSU.CTSUERRS.BIT.CTSUICOMP);                    //    CTSU Error Status Register (CTSUICOMP)

} /* End of function CTSUGetTscapVoltageError() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_Set_CTSU_Power_Supply_Only
* Description  : This API switches  power of AFE (Analog Front End).
* Arguments    : mode
* Return Value : None
***********************************************************************************************************************/
static void R_Set_CTSU_Power_Supply_Only( uint8_t mode )
{
    volatile uint8_t data;

    if (0 == SYSTEM.MSTPCRD.BIT.MSTPD10)
    {
        if (0 == CTSU.CTSUCR0.BIT.CTSUSTRT)
        {
            /***** CTSU Control Register 1 (CTSUCR1) ******************************************************************/
            /* bit7-6  CTSU Measurement Mode Select                                                                   */
            /* bit5-4  CTSU Operating Clock Select                                                                    */
            /* bit3    CTSU Power Supply Capacity Adjustment                                                          */
            /* bit2    CTSU Power Supply Operating Mode Setting                                                       */
            /* bit1    CTSU LPF Capacitance Charging Control                                                          */
            /* bit0    CTSU Power Supply Enable                                                                       */
            /**********************************************************************************************************/
            if( 1 == mode )
            {
                data              = CTSU.CTSUCR1.BYTE;       /* CTSU Control Register 1 (CTSUCR0) storage             */
                data              = data | 0x01;             /* set Power Supply on(bit0)                             */
                CTSU.CTSUCR1.BYTE = data;                    /* set  CTSU Control Register 1 (CTSUCR1)                */
            }
            else
            {
                data              = CTSU.CTSUCR1.BYTE;       /* CTSU Control Register 1 (CTSUCR0) storage             */
                data              = data & 0xFE;             /* set Power Supply off(bit0)                            */
                CTSU.CTSUCR1.BYTE = data;                    /* set  CTSU Control Register 1 (CTSUCR1)                */
            }
        }
    }
} /* End of function R_Set_CTSU_Power_Supply_Only() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: R_Get_CTSU_Counter_Overflow_flag
* Description  :
* Arguments    : None
* Return Value : uint8_t flag    bit1 CTSU Reference Counter Overflow Flag    0 : No overflow
*              :                                                              1 : An overflow
*              :                 bit0 CTSU Sensor Counter Overflow Flag       0 : No overflow
*              :                                                              1 : An overflow
***********************************************************************************************************************/
static uint8_t R_Get_CTSU_Counter_Overflow_flag( void )
{
    uint8_t flag;

