NamJeongkuk/ref_main/src/mini-rx130-cap-touch/e2Studio/src/smc_gen/r_ctsu_qe/src/r_correction.c
    /***** CTSU Channel Transmit/Receive Control Register 1 (CTSUCHTRC1) **********************************************/
    /* bit7    CTSU Mutual Capacitance Status Flag                                                                    */
    /* bit6    CTSU Reference Counter Overflow Flag                                                                   */
    /* bit5    CTSU Sensor Counter Overflow Flag                                                                      */
    /* bit4    CTSU Data Transfer Status Flag                                                                         */
    /* bit3    Reserved                                                                                               */
    /* bit2-0  CTSU Measurement Status Counter                                                                        */
    /******************************************************************************************************************/
    flag = CTSU.CTSUST.BYTE >> 5;                      /* CTSUST Register value 5 right sift reading data storage     */
    flag = flag & 0x03;                                /* bit1,bit0 without mask                                      */
    return flag;
}    /* End of function R_Get_CTSU_Counter_Overflow_flag() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_1st_coefficient_create
* Description  :
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static void correction_CTSU_1st_coefficient_create( void)
{
    /*                                      (g_correction_1st_val * 1024)       g_correction_1st_val +20              */
    /*    g_correction_1st_coefficient  =  -------------------------------  =  --------------------------             */
    /*                                                     40960                            40                        */

    g_correction_1st_coefficient = (g_correction_1st_val + 20 ) / 40;
}    /* End of function correction_CTSU_1st_coefficient_create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_2nd_standard_val_create
* Description  :
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static void correction_CTSU_2nd_standard_val_create( void )
{
#ifdef BSP_MCU_RX23_ALL

    /* convert float to word */
    g_correction_2nd_std_val = (uint16_t)(24824 * CTSU_PRV_WAFER_PARAMETER);        /* ICOG = 66% : 40960, ICOG = 40% : 24824  */
#else
    uint32_t _1st_parm;

    /*                                  g_ctsutrimr_def + 273                    (g_ctsutrimr_def + 273) * 2560 *128  */
    /*    g_correction_2nd_std_val  =  ----------------------- * 40960 *128  =  ------------------------------------- */
    /*                                           528                                               33                 */

    _1st_parm = (g_ctsutrimr_def + 273) * 9930 + 64;
    g_correction_2nd_std_val = (uint16_t)(_1st_parm >> 7);
#endif
}    /* End of function correction_CTSU_2nd_standard_val_create() */


#if (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
#if (!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5))
#pragma section _QE_TOUCH_DRIVER
#else
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_2nd_coefficient_create
* Description  :
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static void correction_CTSU_2nd_coefficient_create( void)
{
    /*                                        g_correction_2nd_val                                                    */
    /*    g_correction_2nd_coefficient  =  -------------------------- * 1024                                          */
    /*                                      g_correction_2nd_std_val                                                  */

    g_correction_2nd_coefficient = ((g_correction_2nd_val << 10) + (g_correction_2nd_std_val/2)) / g_correction_2nd_std_val;
}    /* End of function correction_CTSU_2nd_coefficient_create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: correction_CTSU_16point_coefficient_create
* Description  :
* Arguments    : None
* Return Value : None
***********************************************************************************************************************/
static void correction_CTSU_16point_coefficient_create(void)
{
    uint16_t diff_coefficient;
    uint8_t  up_down;
    uint8_t  loop;
    uint8_t  loop_p;
    uint16_t fill_diff;
    uint32_t work_table;
    uint32_t work_32;
    uint16_t work_16;

    if (g_correction_2nd_coefficient > g_correction_1st_coefficient)
    {
        diff_coefficient = g_correction_2nd_coefficient - g_correction_1st_coefficient;
        up_down = 0;
    }
    else
    {
        diff_coefficient = g_correction_1st_coefficient - g_correction_2nd_coefficient;
        up_down = 1;
    }

    /*         diff_coefficient * 40960                                                                               */
    /*     ----------------------------------                                                                         */
    /*      40960 - g_correction_2nd_std_val                                                                          */
    work_32    = diff_coefficient * 40960;
    work_16    = 40960 - g_correction_2nd_std_val;
    fill_diff  = work_32 / work_16;

    /*                                                                 fill_diff * N                                  */
    /*     g_correction_16point  =  g_correction_1st_coefficient +(-) ---------------                                 */
    /*                                                                      16                                        */
    if (0 == up_down)
    {
        for (loop = 1; 16 > loop; loop++)
        {
            g_correction_16point[loop] = g_correction_1st_coefficient + ((fill_diff * loop) >> 4);
        }
    }
    else
    {
        for (loop = 1; 16 > loop; loop++)
        {
            g_correction_16point[loop] = g_correction_1st_coefficient - ((fill_diff * loop) >> 4);
        }
    }
    g_correction_16point[0] = g_correction_1st_coefficient;

    for (loop = 0, loop_p = 15; loop < 16; loop++)
    {
        work_table                       = g_ctsu_correction_std[loop] * g_correction_16point[loop];
        work_table                       = (work_table + 512)>> 10;

        if(0x0000FFFF < work_table)
        {
            work_table = 0x0000FFFF;
        }

        /* convert uint32_t to uint16_t */
        g_correction_16table[loop]       = (uint16_t)work_table;
        g_correction_16coefficient[loop] = (1024 * 1024) / g_correction_16point[loop_p];
        loop_p = loop_p - 1;
    }

    sensor_linear_interpolation();

}    /* End of function correction_CTSU_16point_coefficient_create() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section _QE_TOUCH_DRIVER
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE(P, _QE_TOUCH_DRIVER)
#endif
/***********************************************************************************************************************
* Function Name: sensor_linear_interpolation
* Description  :
* Arguments    : none
* Return Value : none
***********************************************************************************************************************/
static void sensor_linear_interpolation(void)
{
    uint8_t     loop;
    uint8_t     bnum;
    uint16_t    table_diff;
    uint16_t    coefficient_diff;

    bnum = 0;

    if (g_correction_16coefficient[1] > g_correction_16coefficient[0])
    {
        for (loop = 0; loop < 15; loop++)
        {
            table_diff       = ((g_correction_16table[loop] - g_correction_16table[loop+1]) + 2) / 4;
            g_linear_interpolation_table[bnum]         = g_correction_16table[loop];
            g_linear_interpolation_table[bnum+1]       = g_correction_16table[loop] - table_diff;
            g_linear_interpolation_table[bnum+2]       = g_correction_16table[loop] - (table_diff * 2);
            g_linear_interpolation_table[bnum+3]       = g_correction_16table[loop] - (table_diff * 3);

            coefficient_diff = ((g_correction_16coefficient[loop+1] - g_correction_16coefficient[loop]) +2) / 4;
            g_linear_interpolation_coefficient[bnum]   = g_correction_16coefficient[loop];
            g_linear_interpolation_coefficient[bnum+1] = g_correction_16coefficient[loop] + coefficient_diff;
            g_linear_interpolation_coefficient[bnum+2] = g_correction_16coefficient[loop] + (coefficient_diff * 2);
            g_linear_interpolation_coefficient[bnum+3] = g_correction_16coefficient[loop] + (coefficient_diff * 3);
            bnum = bnum +4;
        }
    }
    else
    {
        for (loop = 0; loop < 15; loop++)
        {
            table_diff       = ((g_correction_16table[loop] - g_correction_16table[loop+1]) + 2) / 4;
            g_linear_interpolation_table[bnum]         = g_correction_16table[loop];
            g_linear_interpolation_table[bnum+1]       = g_correction_16table[loop] - table_diff;
            g_linear_interpolation_table[bnum+2]       = g_correction_16table[loop] - (table_diff * 2);
            g_linear_interpolation_table[bnum+3]       = g_correction_16table[loop] - (table_diff * 3);

            coefficient_diff = ((g_correction_16coefficient[loop] - g_correction_16coefficient[loop+1]) +2) / 4;
            g_linear_interpolation_coefficient[bnum]   = g_correction_16coefficient[loop];
            g_linear_interpolation_coefficient[bnum+1] = g_correction_16coefficient[loop] - coefficient_diff;
            g_linear_interpolation_coefficient[bnum+2] = g_correction_16coefficient[loop] - (coefficient_diff * 2);
            g_linear_interpolation_coefficient[bnum+3] = g_correction_16coefficient[loop] - (coefficient_diff * 3);
            bnum = bnum +4;
        }
    }

    g_linear_interpolation_table[bnum]       = g_correction_16table[loop];
    g_linear_interpolation_coefficient[bnum] = g_correction_16coefficient[loop];

} /* End of function sensor_linear_interpolation() */


#if ((!defined(R_BSP_VERSION_MAJOR) || (R_BSP_VERSION_MAJOR < 5)) && (CTSU_CFG_SAFETY_LINKAGE_ENABLE))
#pragma section
#elif (CTSU_CFG_SAFETY_LINKAGE_ENABLE)
R_BSP_ATTRIB_SECTION_CHANGE_END
#endif
